Revit 2027 API
RebarTrimExtendData.AddBarGeometry(IList<Curve>) Method
 Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarFreeFormValidationResult AddBarGeometry(
	IList<Curve> curves
)
Public Function AddBarGeometry (
	curves As IList(Of Curve)
) As RebarFreeFormValidationResult
public:
RebarFreeFormValidationResult AddBarGeometry(
	IList<Curve^>^ curves
)
member AddBarGeometry :
        curves : IList<Curve> -> RebarFreeFormValidationResult
Parameters
curves IList<Curve>
 Curves describing one bar in the set.
Return Value
RebarFreeFormValidationResult
 Returns Success if everything is ok, otherwise the failure reason.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Incorrect number of bar geometry.
Remarks
This function will can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
See Also
Reference
RebarTrimExtendData Class
AddBarGeometry Overload
Autodesk.Revit.DB.Structure Namespace